app/controllers/manage/events_controller.rb

  def index
    @manage_events = Manage::Event.all
---
SELECT "events".* FROM "events"

  def show
    @manage_event = Manage::Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @manage_event = Manage::Event.new(params[:manage_event])

    respond_to do |format|
      if @manage_event.save
---
INSERT INTO "events" ("city", "contact_info", "created_at", "css_style", "header_file_name", "header_updated_at", "kind", "name", "state", "updated_at", "user_id", "welcome_info") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @manage_event = Manage::Event.find(params[:id])
    @manage_event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 2]]